# Marché du logement
## Introduction :

Cette fois, nous allons créer notre propre jeu de données avec des numéros fictifs pour décrire un marché du logement. Comme nous allons créer des données aléatoires, n'essayez pas de raisonner avec les chiffres.

# 1 - Importer pandas et numpy

In [2]:
import pandas as pd
import numpy as np
import random

# 2. Créez 3 séries différentes, chacune d'une longueur de 100:

    La première avec des nombres aléatoires de 1 à 4.
    La seconde avec des nombres aléatoires de 1 à 3
    La troisième avec des nombres aléatoires de 10 000 à 30 000.

In [21]:
# print(s1, s2, s3)
p1 = pd.Series(np.random.randint(1,5,size=100))
p1

0     2
1     4
2     2
3     2
4     2
     ..
95    1
96    3
97    4
98    2
99    2
Length: 100, dtype: int64

In [22]:
p2 = pd.Series(np.random.randint(1,4,size=100))
p2

0     1
1     1
2     3
3     3
4     3
     ..
95    2
96    1
97    1
98    2
99    2
Length: 100, dtype: int64

In [23]:
p3 = pd.Series(np.random.randint(10000,30000,size=100))
p3

0     12444
1     13613
2     25418
3     19280
4     27859
      ...
95    16414
96    27576
97    13604
98    14466
99    19878
Length: 100, dtype: int64

In [24]:
s1= pd.DataFrame(p1)
s1

    0
0   2
1   4
2   2
3   2
4   2
.. ..
95  1
96  3
97  4
98  2
99  2

[100 rows x 1 columns]

In [25]:
s2= pd.DataFrame(p2)
s2

    0
0   1
1   1
2   3
3   3
4   3
.. ..
95  2
96  1
97  1
98  2
99  2

[100 rows x 1 columns]

In [26]:
s3= pd.DataFrame(p3)
s3

        0
0   12444
1   13613
2   25418
3   19280
4   27859
..    ...
95  16414
96  27576
97  13604
98  14466
99  19878

[100 rows x 1 columns]

# 3 - Créer un DataFrame en joignant les 3 séries par colonne

In [31]:
im = pd.concat([p1,p2,p3],axis=1)
im

    0  1      2
0   2  1  12444
1   4  1  13613
2   2  3  25418
3   2  3  19280
4   2  3  27859
.. .. ..    ...
95  1  2  16414
96  3  1  27576
97  4  1  13604
98  2  2  14466
99  2  2  19878

[100 rows x 3 columns]

# 4 - Changer le titre des colonnes en mettant chambre, douche, prixm2

In [32]:
im.columns=['chambre','douche','prixm2']
im

    chambre  douche  prixm2
0         2       1   12444
1         4       1   13613
2         2       3   25418
3         2       3   19280
4         2       3   27859
..      ...     ...     ...
95        1       2   16414
96        3       1   27576
97        4       1   13604
98        2       2   14466
99        2       2   19878

[100 rows x 3 columns]

 # 5 - Créer une série avec s1,s2,s3.
 
 Ce Dataframe doit contenir la totalité des séries s1,s2,s3 mais sur une seule colonne

In [37]:
m = pd.concat([p1,p2,p3])
m

0         2
1         4
2         2
3         2
4         2
      ...
95    16414
96    27576
97    13604
98    14466
99    19878
Length: 300, dtype: int64

# 6 - Quel est la taille de cette série ?

In [40]:
m.size

300

# 7 - Quel est le type d'objet ?

In [41]:
type(m)

pandas.core.series.Series

# 8 - Créer un dataFrame d'une colonne avec cette série

In [44]:
x= pd.DataFrame(m)
x

        0
0       2
1       4
2       2
3       2
4       2
..    ...
95  16414
96  27576
97  13604
98  14466
99  19878

[300 rows x 1 columns]

In [47]:
type(x)

pandas.core.frame.DataFrame

# 9 - Réindexer col

In [45]:
im.reset_index(drop=True)

    chambre  douche  prixm2
0         2       1   12444
1         4       1   13613
2         2       3   25418
3         2       3   19280
4         2       3   27859
..      ...     ...     ...
95        1       2   16414
96        3       1   27576
97        4       1   13604
98        2       2   14466
99        2       2   19878

[100 rows x 3 columns]

In [46]:
m.reset_index(drop=True)

0          2
1          4
2          2
3          2
4          2
       ...
295    16414
296    27576
297    13604
298    14466
299    19878
Length: 300, dtype: int64